; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph2 - mode
	spectrograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Phenomenon5)
	(have_image Phenomenon5 spectrograph1)
	(have_image Star6 infrared0)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Planet10 thermograph2)
	(have_image Planet11 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite3 planet7 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet7)
   goals met: 0 of 8
5. (take_image satellite3 planet7 instrument6 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite3 planet11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet11)
   goals met: 1 of 8
7. (take_image satellite3 planet11 instrument6 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite3 planet10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet10)
   goals met: 2 of 8
9. (take_image satellite3 planet10 instrument6 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 3 of 8
10. (turn_to satellite2 groundstation4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation4)
   goals met: 4 of 8
11. (turn_to satellite3 star6 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star6)
   goals met: 4 of 8
12. (take_image satellite3 star6 instrument6 infrared0)
   added: (have_image star6 infrared0)
   goals met: 5 of 8
13. (turn_to satellite3 star8 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star8)
   goals met: 5 of 8
14. (take_image satellite3 star8 instrument6 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 8
15. (turn_to satellite3 phenomenon5 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon5)
   goals met: 7 of 8
16. (take_image satellite3 phenomenon5 instrument6 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 8 of 8
